app/controllers/school_classes_controller.rb

def create
  @school_class = SchoolClass.create(school_class_params)
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Computer Science"], ["room_number", 5]]

def edit
 @school_class = SchoolClass.find_by(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT 1

def update
  @school_class = SchoolClass.find_by(params[:id])
  @school_class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT 1
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]

def show
  @school_class = SchoolClass.find_by(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE (new) LIMIT 1